000001 IDENTIFICATION DIVISION
000002 PROGRAM-ID. "HELLOWORLD".
000003 AUTHOR. FRANK
000004*Well this is the start
000005*of my learning process for COBOL
000006
000007 ENVIRONMENT DIVISION.
000008
000009 DATA DIVISION.
000010
000011 PROCEDURE DIVISION.
000012 0100-START-HERE.
000013      DISPLAY "Hello World!".
000014 STOP RUN.
000015 END PROGRAM HELLOWORLD.